raphmaster/aic/boards.txt

arduino_due_x_dbg.name=Arduino Due (Programming Port)
arduino_due_x_dbg.vid.0=0x2341
arduino_due_x_dbg.pid.0=0x003d
arduino_due_x_dbg.vid.1=0x2A03
arduino_due_x_dbg.pid.1=0x003d
arduino_due_x_dbg.upload.tool=bossac
arduino_due_x_dbg.upload.protocol=sam-ba
arduino_due_x_dbg.upload.maximum_size=262144
arduino_due_x_dbg.upload.maximum_data_size=98304
arduino_due_x_dbg.upload.use_1200bps_touch=true
arduino_due_x_dbg.upload.wait_for_upload_port=false
arduino_due_x_dbg.upload.native_usb=false
arduino_due_x_dbg.build.mcu=cortex-m3
arduino_due_x_dbg.build.f_cpu=84000000L
arduino_due_x_dbg.build.usb_manufacturer="Arduino LLC"
arduino_due_x_dbg.build.usb_product="Arduino Due"
arduino_due_x_dbg.build.board=SAM_DUE
arduino_due_x_dbg.build.core=arduino
arduino_due_x_dbg.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x_dbg.build.variant=arduino_due_x
arduino_due_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x_dbg.build.vid=0x2341
arduino_due_x_dbg.build.pid=0x003e

arduino_due_x.name=Arduino Due (Native USB Port)
arduino_due_x.vid.0=0x2341
arduino_due_x.pid.0=0x003e
arduino_due_x.vid.1=0x2A03
arduino_due_x.pid.1=0x003e
arduino_due_x.upload.tool=bossac
arduino_due_x.upload.protocol=sam-ba
arduino_due_x.upload.maximum_size=524288
arduino_due_x.upload.use_1200bps_touch=true
arduino_due_x.upload.wait_for_upload_port=true
arduino_due_x.upload.native_usb=true
arduino_due_x.build.mcu=cortex-m3
arduino_due_x.build.f_cpu=84000000L
arduino_due_x.build.usb_manufacturer="Arduino LLC"
arduino_due_x.build.usb_product="Arduino Due"
arduino_due_x.build.board=SAM_DUE
arduino_due_x.build.core=arduino
arduino_due_x.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_x.build.ldscript=linker_scripts/gcc/flash.ld
arduino_due_x.build.variant=arduino_due_x
arduino_due_x.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_x.build.vid=0x2341
arduino_due_x.build.pid=0x003e

arduino_due_bootloader.name=Arduino Due Bootloader (Programming Port)
arduino_due_bootloader.vid.0=0x2341
arduino_due_bootloader.pid.0=0x003d
arduino_due_bootloader.vid.1=0x2A03
arduino_due_bootloader.pid.1=0x003d
arduino_due_bootloader.upload.tool=bossac
arduino_due_bootloader.upload.protocol=sam-ba
arduino_due_bootloader.upload.maximum_size=262144
arduino_due_bootloader.upload.maximum_data_size=98304
arduino_due_bootloader.upload.use_1200bps_touch=true
arduino_due_bootloader.upload.wait_for_upload_port=false
arduino_due_bootloader.upload.native_usb=false
arduino_due_bootloader.build.mcu=cortex-m3
arduino_due_bootloader.build.f_cpu=84000000L
arduino_due_bootloader.build.usb_manufacturer="Arduino LLC"
arduino_due_bootloader.build.usb_product="Arduino Due"
arduino_due_bootloader.build.board=SAM_DUE
arduino_due_bootloader.build.core=arduino
arduino_due_bootloader.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_bootloader.build.ldscript=linker_scripts/gcc/flash-bootloader.ld
arduino_due_bootloader.build.variant=arduino_due_x
arduino_due_bootloader.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_bootloader.build.vid=0x2341
arduino_due_bootloader.build.pid=0x003e

arduino_due_firmware.name=Arduino Due Firmware (Programming Port)
arduino_due_firmware.vid.0=0x2341
arduino_due_firmware.pid.0=0x003d
arduino_due_firmware.vid.1=0x2A03
arduino_due_firmware.pid.1=0x003d
arduino_due_firmware.upload.tool=bossac
arduino_due_firmware.upload.protocol=sam-ba
arduino_due_firmware.upload.maximum_size=262144
arduino_due_firmware.upload.maximum_data_size=98304
arduino_due_firmware.upload.use_1200bps_touch=true
arduino_due_firmware.upload.wait_for_upload_port=false
arduino_due_firmware.upload.native_usb=false
arduino_due_firmware.build.mcu=cortex-m3
arduino_due_firmware.build.f_cpu=84000000L
arduino_due_firmware.build.usb_manufacturer="Arduino LLC"
arduino_due_firmware.build.usb_product="Arduino Due"
arduino_due_firmware.build.board=SAM_DUE
arduino_due_firmware.build.core=arduino
arduino_due_firmware.build.extra_flags=-D__SAM3X8E__ -mthumb {build.usb_flags}
arduino_due_firmware.build.ldscript=linker_scripts/gcc/flash-firmware.ld
arduino_due_firmware.build.variant=arduino_due_x
arduino_due_firmware.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
arduino_due_firmware.build.vid=0x2341
arduino_due_firmware.build.pid=0x003e